Revit 2026 API

# ContextMenu Properties

---

The ContextMenu type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ContextMenu Class

Autodesk.Revit.UI Namespace